<?php
/**
 *Author 龙辉 QQ1790716272
 *Time  2021/10/16 16:53
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *                     佛祖保佑，永不出BUG
 */


//加载核心
require('./core.php');
//判断是否登录
/*if (!TFYT('loginuser')) {
    exit("<script language='javascript'>alert('请先登录后再进行操作！');window.location.href='/?index=Login';</script>");
}*/
//获取URL
$index = GET('main') ? GET('main') : 'index';

//               代码加载完毕,就是如此简单 ︿(￣︶￣)︿