<?php
/**
 *Author 龙辉 QQ1790716272
 *Time  2021/10/18 22:01
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *                     佛祖保佑，永不出BUG
 */
 use TF\TFcore;
require_once('../core.php');
$index = GET('main') ? GET('main') : 'login';
//选择路由
switch ($index) {
    case 'login':
        include_once './login.php';
        break;
    case 'reg':
        include_once './reg.php';
        break;
    default:
        showmsg();
        break;
}
//               代码加载完毕,就是如此简单 ︿(￣︶￣)︿
